{
  "privacyPolicy": {
    "title": "سياسة الخصوصية",
    "lastUpdated": "آخر تحديث: 26-02-2025",
    "introduction": "في جلف ركزة، نقدر خصوصيتك ونلتزم بحماية معلوماتك الشخصية. تشرح هذه السياسة كيفية جمع معلوماتك عند زيارة موقعنا واستخدامها والإفصاح عنها وحمايتها.",
    "informationWeCollect": {
      "title": "المعلومات التي نجمعها",
      "personalData": "البيانات الشخصية: قد نجمع معلومات شخصية مثل اسمك وعنوان بريدك الإلكتروني ورقم هاتفك وغيرها من بيانات الاتصال عندما تزودنا بها طوعًا.",
      "usageData": "بيانات الاستخدام: نجمع تلقائيًا معلومات حول كيفية وصولك إلى موقعنا واستخدامه، بما في ذلك عنوان IP ونوع المتصفح والصفحات التي تزورها ومدة بقائك في الموقع.",
      "cookies": "ملفات تعريف الارتباط وتقنيات التتبع: نستخدم ملفات تعريف الارتباط لتحسين تجربة التصفح وتحليل حركة المرور على الموقع وفهم مصادر زياراتنا."
    },
    "howWeUse": {
      "title": "كيف نستخدم معلوماتك",
      "intro": "قد نستخدم المعلومات التي نجمعها من أجل:",
      "items": [
        "توفير موقعنا وتشغيله وصيانته.",
        "تحسين موقعنا وتخصيصه وتوسيعه.",
        "فهم كيفية استخدامك لموقعنا وتحليلها.",
        "تطوير منتجات وخدمات وميزات ووظائف جديدة.",
        "التواصل معك بشأن التحديثات أو العروض أو أي معلومات أخرى ذات صلة."
      ]
    },
    "disclosure": {
      "title": "الإفصاح عن معلوماتك",
      "intro": "قد نشارك معلوماتك في الحالات التالية:",
      "items": [
        "مع مزودي الخدمات الذين يؤدون خدمات نيابةً عنا.",
        "استجابةً لطلبات قانونية أو للامتثال للالتزامات القانونية.",
        "في حال الاندماج أو الاستحواذ أو بيع كل أو جزء من أصولنا."
      ]
    },
    "rights": {
      "title": "حقوقك واختياراتك",
      "body": "لديك الحق في الوصول إلى معلوماتك الشخصية أو تصحيحها أو حذفها. ويمكنك أيضًا إلغاء الاشتراك في الرسائل التسويقية. لممارسة هذه الحقوق، يرجى التواصل معنا عبر البريد الإلكتروني privacy@gulfrakza.com."
    },
    "security": {
      "title": "الأمان",
      "body": "نتخذ خطوات معقولة لحماية معلوماتك الشخصية من الوصول أو الاستخدام أو الإفصاح غير المصرح به. ومع ذلك، لا توجد طريقة نقل عبر الإنترنت آمنة تمامًا."
    },
    "changes": {
      "title": "التغييرات على سياسة الخصوصية هذه",
      "body": "قد نقوم بتحديث سياسة الخصوصية من وقت لآخر. عند إجراء تغييرات، سنحدّث تاريخ «آخر تحديث» أعلى الصفحة. يُعد استمرارك في استخدام الموقع بعد أي تغييرات قبولًا للسياسة المحدّثة."
    },
    "contact": {
      "title": "تواصل معنا",
      "body": "إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى التواصل معنا عبر البريد الإلكتروني privacy@gulfrakza.com."
    }
  },
  "termsOfService": {
    "title": "شروط الخدمة",
    "lastUpdated": "آخر تحديث: 26-02-2025",
    "acceptance": {
      "title": "قبول الشروط",
      "body": "بدخولك إلى موقع جلف ركزة الإلكتروني («الخدمة») أو استخدامه، فإنك توافق على الالتزام بهذه الشروط وبجميع القوانين والأنظمة المعمول بها. إذا لم توافق على أي من هذه الشروط، يُحظر عليك استخدام الخدمة أو الوصول إليها."
    },
    "use": {
      "title": "استخدام الخدمة",
      "body": "تمنحك جلف ركزة ترخيصًا محدودًا وغير حصري وغير قابل للتحويل للوصول إلى الخدمة واستخدامها لأغراضك الشخصية والتجارية وفقًا لهذه الشروط."
    },
    "responsibilities": {
      "title": "مسؤوليات المستخدم",
      "body": "أنت مسؤول عن سلوكك أثناء استخدام الخدمة. وتوافق على عدم استخدام الخدمة لأي غرض غير قانوني أو محظور، والامتثال لجميع القوانين واللوائح المحلية والوطنية والدولية."
    },
    "intellectualProperty": {
      "title": "حقوق الملكية الفكرية",
      "body": "المحتوى الموجود على موقع جلف ركزة، بما في ذلك النصوص والرسوم والشعارات والصور والبرمجيات، ملك لجلف ركزة أو مرخّصيها ومحمٍ بموجب قوانين الملكية الفكرية المعمول بها."
    },
    "disclaimer": {
      "title": "إخلاء المسؤولية وتحديدها",
      "body": "تُقدّم الخدمة «كما هي» و«حسب التوفر» دون أي ضمانات صريحة أو ضمنية. لن تتحمّل جلف ركزة أي أضرار ناجمة عن استخدامك للخدمة."
    },
    "law": {
      "title": "القانون الحاكم",
      "body": "تخضع هذه الشروط وتُفسّر وفق قوانين [منطقتك] دون اعتبار لتعارض القوانين."
    },
    "changes": {
      "title": "التغييرات على الشروط",
      "body": "تحتفظ جلف ركزة بالحق في تعديل هذه الشروط في أي وقت. سيتم نشر التغييرات في هذه الصفحة، ويُعد استمرارك في استخدام الخدمة قبولًا للشروط المحدّثة."
    },
    "contact": {
      "title": "معلومات الاتصال",
      "body": "إذا كانت لديك أي أسئلة بشأن هذه الشروط، يرجى التواصل معنا عبر البريد الإلكتروني info@gulfrakza.com."
    }
  }
}
